example2/test14d/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    outlet
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }

    "(floor|ceiling|east|west|north|south|bed_bed)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(back_left_Object01|back_right_Object01|chest_left_Object01|chest_right_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(waist_left_back_Object01|waist_left_front_Object01|waist_right_back_Object01|waist_right_front_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(femur_left_back_Object01|femur_left_front_Object01|femur_right_back_Object01|femur_right_front_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(lowerleg_left_back_Object01|lowerleg_left_front_Object01|lowerleg_right_back_Object01|lowerleg_right_front_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(upperarm_left_back_Object01|upperarm_left_front_Object01|upperarm_right_back_Object01|upperarm_right_front_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(forearm_left_back_Object01|forearm_left_front_Object01|forearm_right_back_Object01|forearm_right_front_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(foot_left_Object01|foot_right_Object01|hand_left_Object01|hand_right_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
    "(neck_back_Object01|neck_front_Object01|face_Object01|head_Object01)"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
        emissivityMode  lookup;
        emissivity      uniform 0.9;
    }
}

// ************************************************************************* //
