example2/test14d/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0  1.62  -2.0)
    (4.0  1.62  -2.0)
    (4.0  4.02  -2.0)
    (0.0  4.02  -2.0)
    (0.0  1.62  2.0)
    (4.0  1.62  2.0)
    (4.0  4.02  2.0)
    (0.0  4.02  2.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 24 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    north
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );
    }
    south
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    east
    {
        type wall;
        faces
        (
            (3 0 4 7)
        );
    }
    west
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
