example2/test14d/constant/triSurface~/illegalFaces

160
(
1906
1911
1912
1919
1921
1923
1925
1927
1929
1931
1933
1935
1937
1939
1941
1943
1945
1947
1949
1951
1953
1955
1957
1959
1961
1963
1965
1967
1969
1971
1973
1975
1977
2298
2300
2315
2317
2551
2561
2562
2565
2567
2568
2571
2572
2574
2576
2578
2580
2582
2584
2987
7144
7160
8527
8528
10253
10254
10257
10259
10261
10263
10265
10267
10269
10271
10273
10275
10277
10279
10281
10283
10285
10286
10287
10289
10291
10293
10295
10297
10299
10301
10303
10305
10307
10309
10311
10313
10315
10552
10559
10563
10576
10819
10821
10822
10824
10825
10826
10827
10829
10830
10831
10832
10833
10834
10835
10836
10838
10839
10840
10841
10842
10843
10844
10845
10847
10848
10850
10851
10853
10854
10856
10857
10858
10861
10862
10863
10864
10865
10866
10867
10868
10869
10870
10871
10872
10873
10874
10875
10876
10878
10879
10880
10881
10882
10883
10884
10885
10887
10888
10889
10890
10900
10901
10902
10903
11248
14859
14860
)
