example2/test14d/constant/triSurface~/problemFaces

2940
(
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
46
47
47
55
57
59
67
81
81
82
82
83
93
98
100
104
105
107
108
109
110
117
118
120
122
124
126
128
138
139
142
144
145
155
159
161
163
165
173
180
188
191
193
195
197
200
202
204
208
209
214
219
221
223
225
227
238
240
241
247
248
249
250
251
252
253
254
255
256
257
258
259
260
261
264
265
267
269
272
273
...
)
