example2/test14d/constant/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


writeViewFactorMatrix     true;
writeFacesAgglomeration   true;
writePatchViewFactors     false;

"(inlet|outlet)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
bed_bed
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
floor
{
    nFacesInCoarsestLevel     34;
    featureAngle              10;
}
ceiling
{
    nFacesInCoarsestLevel     34;
    featureAngle              10;
}
"(north|south)"
{
    nFacesInCoarsestLevel     3;
    featureAngle              10;
}
"(east|west)"
{
    nFacesInCoarsestLevel     11;
    featureAngle              10;
}
"(back_left_Object01|back_right_Object01|chest_left_Object01|chest_right_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
"(waist_left_back_Object01|waist_left_front_Object01|waist_right_back_Object01|waist_right_front_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
"(femur_left_back_Object01|femur_left_front_Object01|femur_right_back_Object01|femur_right_front_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
"(lowerleg_left_back_Object01|lowerleg_left_front_Object01|lowerleg_right_back_Object01|lowerleg_right_front_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
"(upperarm_left_back_Object01|upperarm_left_front_Object01|upperarm_right_back_Object01|upperarm_right_front_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
"(forearm_left_back_Object01|forearm_left_front_Object01|forearm_right_back_Object01|forearm_right_front_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
"(foot_left_Object01|foot_right_Object01|hand_left_Object01|hand_right_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}
"(neck_back_Object01|neck_front_Object01|face_Object01|head_Object01)"
{
    nFacesInCoarsestLevel     1;
    featureAngle              10;
}


// ************************************************************************* //
